<h3>Спасибо за подписку</h3>
<br />
Ваш e-mail подтверждён,сертификат выслан, рассылка успешно активирована.<br />
<br />
Мы дарим Вам сертификат на 1000 рублей! Его номер – <b>{$data.code}</b><br />
Вы сможете использовать эти деньги для оплаты любого товара в магазине Luxpodarki.ru, при условии, что сумма заказа превышает 20000 руб.<br />
<br />
Для активации сертификата необходимо:<br />
1.	Выбрать понравившийся товар из каталога <a href="http://luxpodarki.ru/catalog.html">Luxpodarki.ru</a>;<br />
2.	При оформлении доставки ввести номер сертификата ({$data.code}) в поле промокод.<br />
Наслаждайтесь радостью выгодной покупки!<br />
<br />
<br />
Желаем Вам приятных покупок!<br />
С уважением, команда Luxpodarki.ru.

