<html>
<body>
Здравствуйте, {$data.author}!<br />
Вы (или кто-то от Вашего имени) выразили желание подписаться на нашу рассылку и получить бонусный сертификат.<br />
Для того, чтобы подтвердить подписку, перейдите по <a href="http://luxpodarki.ru{$data.uribase}/activate?code={$data.activation_code}">ссылке активации</a>.<br />
<br />
После активации Вы получите сертификат!<br />
Если Вы не желаете подписываться, проигнорируйте это письмо.<br />
<br />
С уважением, команда Luxpodarki.ru.<br />
<br />
ООО "Подарки королей"<br />
www.Luxpodarki.ru<br />
т. +7 (495) 969-77-50<br />
+7 (499) 502-87-37 <br />
моб. 8 (903) 582-30-11<br />
8 (985) 990-53-59<br />
e-mail: <a href="mailto:luxpodarok@mail.ru">luxpodarok@mail.ru</a>
</body>
</html>
