<html>
<body>
Здравствуйте, {$data.author}<br />
<br />
Поздравляем, Вы получили сертификат на 1000 рублей!<br />
Его номер – {$data.code}<br />
Вы сможете использовать эти деньги для оплаты любого товара в магазине <a href="http://Luxpodarki.ru">Luxpodarki.ru</a>, при условии, что сумма заказа превышает 20000 руб.<br />
<br />
Для активации сертификата необходимо:<br />
1.	Перейти на сайт <a href="http://Luxpodarki.ru">Luxpodarki.ru</a><br />
2.	Выбрать понравившийся товар<br />
3.	При оформлении ввести номер {$data.code} в поле промокод<br />
Наслаждайтесь радостью выгодной покупки!<br />
<br />
<br />
Желаем Вам приятных покупок!<br />
С уважением, команда Luxpodarki.ru. <br />
ООО "Подарки королей"<br />
www.Luxpodarki.ru<br />
т. +7 (495) 969-77-50<br />
+7 (499) 502-87-37<br />
моб. 8 (903) 582-30-11<br />
8 (985) 990-53-59<br />
e-mail: <a href="mailto:luxpodarok@mail.ru">luxpodarok@mail.ru</a><br />

</body>
</html>
